hangman-server/loadTest.yml
config:
  target: 'https://hangman-nine-fawn.vercel.app'
  phases:
    - duration: 10
      arrivalRate: 100
      name: Ramp-up to 100 users
    - duration: 10
      arrivalRate: 500
      name: Ramp-up to 500 users
    - duration: 10
      arrivalRate: 1000
      name: Ramp-up to 1000 users
    - duration: 10
      arrivalRate: 5000
      name: Ramp-up to 5000 users
    - duration: 10
      arrivalRate: 10000
      name: Ramp-up to 10000 users
scenarios:
  - flow:
      - get:
          url: "/game"
      - get:
          url: "/leaderboard"